balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS608.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no" ?><edc:PIC xmlns:edc="http://crownking/edc" edc:arch="33xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="DSPIC33FJ64GS608" edc:procid="0x123" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="3.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="3.000" edc:minvoltage="3.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="1000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="128" edc:rowerase="128"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="33xxxx" edc:name="33xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0x0" edc:id="PgmBootNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x0" edc:id="NoBootCode" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x7FE" edc:id="PgmBootStdSm" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x7FE" edc:id="StdSmBootCode" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x1FFE" edc:id="PgmBootStdMed" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1FFE" edc:id="StdMedBootCode" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3FFE" edc:id="PgmBootStdLarge" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x3FFE" edc:id="StdLarBootCode" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x7FE" edc:id="PgmBootHighSm" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x7FE" edc:id="HiSmBootCode" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x1FFE" edc:id="PgmBootHighMed" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1FFE" edc:id="HiMedBootCode" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3FFE" edc:id="PgmBootHighLarge" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x3FFE" edc:id="HiLarBootCode" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegWriteProtect edc:disableid="PgmBootWrtProtectOff" edc:enableid="PgmBootWrtProtectOn"/>
      </edc:Seg>
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0xABFE" edc:id="PgmGenNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0xABFE" edc:id="PgmGenStd" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegNature edc:addr="0xABFE" edc:id="PgmGenHigh" edc:segsecurity="High" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="Data">
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="DMACError" edc:desc="DMAC Error Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Resereved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="Input Compare 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="Timer 1" edc:irq="3"/>
    <edc:Interrupt edc:cname="DMA0Interrupt" edc:desc="DMA Channel 0" edc:irq="4"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="Timer 2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="Timer 3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1 error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 transfer done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADCInterrupt" edc:desc="ADC Group Convert Done" edc:irq="13"/>
    <edc:Interrupt edc:cname="DMA1Interrupt" edc:desc="DMA Channel 1" edc:irq="14"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CMP1Interrupt" edc:desc="Analog Comparator1 Interrupt" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="DMA2Interrupt" edc:desc="DMA Channel 2" edc:irq="24"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="Timer 4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="Timer 5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2 error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 transfer done" edc:irq="33"/>
    <edc:Interrupt edc:cname="C1RxRdyInterrupt" edc:desc="ECAN1 Receive Data  Ready" edc:irq="34"/>
    <edc:Interrupt edc:cname="C1Interrupt" edc:desc="ECAN1 Event" edc:irq="35"/>
    <edc:Interrupt edc:cname="DMA3Interrupt" edc:desc="DMA Channel 3" edc:irq="36"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="External Interrupt 3" edc:irq="53"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="External Interrupt 4" edc:irq="54"/>
    <edc:Interrupt edc:cname="PWMSpEventMatchInterrupt" edc:desc="PWM special event match" edc:irq="57"/>
    <edc:Interrupt edc:cname="QEI1Interrupt" edc:desc="QEI1 Position Counter Compare" edc:irq="58"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="C1TxReqInterrupt" edc:desc="ECAN1 Transmit Data Request" edc:irq="70"/>
    <edc:Interrupt edc:cname="PWMSecSpEventMatchInterrupt" edc:desc="PWM secondary special event match" edc:irq="73"/>
    <edc:Interrupt edc:cname="QEI2Interrupt" edc:desc="QEI2 Position Counter Compare" edc:irq="75"/>
    <edc:Interrupt edc:cname="ADCP8Interrupt" edc:desc="ADC Pair 8 Convert Done" edc:irq="81"/>
    <edc:Interrupt edc:cname="ADCP12Interrupt" edc:desc="ADC Pair 12 Convert Done" edc:irq="85"/>
    <edc:Interrupt edc:cname="PWM1Interrupt" edc:desc="PWM1 Interrupt" edc:irq="94"/>
    <edc:Interrupt edc:cname="PWM2Interrupt" edc:desc="PWM2 Interrupt" edc:irq="95"/>
    <edc:Interrupt edc:cname="PWM3Interrupt" edc:desc="PWM3 Interrupt" edc:irq="96"/>
    <edc:Interrupt edc:cname="PWM4Interrupt" edc:desc="PWM4 Interrupt" edc:irq="97"/>
    <edc:Interrupt edc:cname="PWM5Interrupt" edc:desc="PWM5 Interrupt" edc:irq="98"/>
    <edc:Interrupt edc:cname="PWM6Interrupt" edc:desc="PWM6 Interrupt" edc:irq="99"/>
    <edc:Interrupt edc:cname="PWM7Interrupt" edc:desc="PWM7 Interrupt" edc:irq="100"/>
    <edc:Interrupt edc:cname="PWM8Interrupt" edc:desc="PWM8 Interrupt" edc:irq="101"/>
    <edc:Interrupt edc:cname="CMP2Interrupt" edc:desc="Analog Comparator2 Interrupt" edc:irq="103"/>
    <edc:Interrupt edc:cname="CMP3Interrupt" edc:desc="Analog Comparator3 Interrupt " edc:irq="104"/>
    <edc:Interrupt edc:cname="CMP4Interrupt" edc:desc="Analog Comparator4 Interrupt" edc:irq="105"/>
    <edc:Interrupt edc:cname="ADCP0Interrupt" edc:desc="ADC Pair 0 Convert Done" edc:irq="110"/>
    <edc:Interrupt edc:cname="ADCP1Interrupt" edc:desc="ADC Pair 1 Convert Done" edc:irq="111"/>
    <edc:Interrupt edc:cname="ADCP2Interrupt" edc:desc="ADC Pair 2 Convert Done" edc:irq="112"/>
    <edc:Interrupt edc:cname="ADCP3Interrupt" edc:desc="ADC Pair 3 Convert Done" edc:irq="113"/>
    <edc:Interrupt edc:cname="ADCP4Interrupt" edc:desc="ADC Pair 4 Convert Done" edc:irq="114"/>
    <edc:Interrupt edc:cname="ADCP5Interrupt" edc:desc="ADC Pair 5 Convert Done" edc:irq="115"/>
    <edc:Interrupt edc:cname="ADCP6Interrupt" edc:desc="ADC Pair 6 Convert Done" edc:irq="116"/>
    <edc:Interrupt edc:cname="ADCP7Interrupt" edc:desc="ADC Pair 7 Convert Done" edc:irq="117"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x6" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0xAC00" edc:regionid="program"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x801000" edc:regionid="testmem"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf80012" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="------------nnnn" edc:cname="FBS" edc:default="0xffffff" edc:desc="" edc:impl="0xf" edc:name="FBS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BWRP" edc:desc="Boot Segment Write Protect" edc:mask="0x1" edc:name="BWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_OFF" edc:codeguardidref="PgmBootWrtProtectOff" edc:desc="Boot Segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_ON" edc:codeguardidref="PgmBootWrtProtectOn" edc:desc="Boot Segment is write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BSS" edc:desc="Boot Segment Program Flash Code Protection" edc:mask="0x7" edc:name="BSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_CODE" edc:codeguardidref="NoBootCode" edc:desc="No Boot Segment" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_BOOT_CODE" edc:codeguardidref="StdSmBootCode" edc:desc="Standard Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="STRD_MEDIUM_BOOT_CODE" edc:codeguardidref="StdMedBootCode" edc:desc="Standard Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="STRD_LARGE_BOOT_CODE" edc:codeguardidref="StdLarBootCode" edc:desc="Standard Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_BOOT_CODE" edc:codeguardidref="HiSmBootCode" edc:desc="High Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_BOOT_CODE" edc:codeguardidref="HiMedBootCode" edc:desc="High Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_LARGE_BOOT_CODE" edc:codeguardidref="HiLarBootCode" edc:desc="High Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="NO_FLASH" edc:codeguardidref="PgmBootNone" edc:desc="No Boot Segment Program Memory" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_STD" edc:codeguardidref="PgmBootStdSm" edc:desc="Standard Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_STD" edc:codeguardidref="PgmBootStdMed" edc:desc="Standard Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_STD" edc:codeguardidref="PgmBootStdLarge" edc:desc="Standard Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_HIGH" edc:codeguardidref="PgmBootHighSm" edc:desc="High Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_HIGH" edc:codeguardidref="PgmBootHighMed" edc:desc="High Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_HIGH" edc:codeguardidref="PgmBootHighLarge" edc:desc="High Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="2"/>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FGS" edc:default="0xffffff" edc:desc="" edc:impl="0x7" edc:name="FGS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="General Segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="General Segment is write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GSS" edc:desc="General Segment Code Protection" edc:mask="0x3" edc:name="GSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenNone" edc:desc="General Segment Code protect is disabled" edc:when="(field &amp; 0x3) == 0x3">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_OFF"/>
                  <edc:LegacyAlias edc:cname="GCP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenStd" edc:desc="Standard Security Code protection Enabled" edc:when="(field &amp; 0x3) == 0x2">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0xAC00"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_STD"/>
                  <edc:LegacyAlias edc:cname="GCP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:codeguardidref="PgmGenHigh" edc:desc="High Security Code Protection Enabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0xAC00"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
