balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS608.PIC
        <edc:SFRDef edc:access="nnnnnn----nnnnnn" edc:cname="LEBCON3" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000----000000" edc:name="LEBCON3" edc:nzwidth="0x10" edc:por="000000----000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BPLL" edc:desc="" edc:mask="0x1" edc:name="BPLL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPLH" edc:desc="" edc:mask="0x1" edc:name="BPLH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPHL" edc:desc="" edc:mask="0x1" edc:name="BPHL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPHH" edc:desc="" edc:mask="0x1" edc:name="BPHH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCH" edc:desc="" edc:mask="0x1" edc:name="BCH" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CLLEBEN" edc:desc="" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:desc="" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLF" edc:desc="" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLR" edc:desc="" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnn---" edc:cname="LEBDLY3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000---" edc:name="LEBDLY3" edc:nzwidth="16" edc:por="-----00000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB" edc:desc="" edc:mask="0xff" edc:name="LEB" edc:nzwidth="9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB0" edc:desc="" edc:mask="0x1" edc:name="LEB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB1" edc:desc="" edc:mask="0x1" edc:name="LEB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB2" edc:desc="" edc:mask="0x1" edc:name="LEB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB3" edc:desc="" edc:mask="0x1" edc:name="LEB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB4" edc:desc="" edc:mask="0x1" edc:name="LEB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB5" edc:desc="" edc:mask="0x1" edc:name="LEB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB6" edc:desc="" edc:mask="0x1" edc:name="LEB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB7" edc:desc="" edc:mask="0x1" edc:name="LEB7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB8" edc:desc="" edc:mask="0x1" edc:name="LEB8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn--nnnnnn" edc:cname="AUXCON3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000--000000" edc:name="AUXCON3" edc:nzwidth="16" edc:por="00--0000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHOPLEN" edc:desc="" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPHEN" edc:desc="" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL" edc:desc="" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL" edc:desc="" edc:mask="0xf" edc:name="BLANKSEL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="HRDDIS" edc:desc="" edc:mask="0x1" edc:name="HRDDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HRPDIS" edc:desc="" edc:mask="0x1" edc:name="HRPDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL0" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL1" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL2" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL3" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL0" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL1" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL2" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL3" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrnnnnnnnn-nnnn" edc:cname="PWMCON4" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000-0000" edc:name="PWMCON4" edc:nzwidth="0x10" edc:por="00000000000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IUE" edc:desc="" edc:mask="0x1" edc:name="IUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XPRES" edc:desc="" edc:mask="0x1" edc:name="XPRES" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAM" edc:desc="" edc:mask="0x1" edc:name="CAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MTBS" edc:desc="" edc:mask="0x1" edc:name="MTBS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DTCP" edc:desc="" edc:mask="0x1" edc:name="DTCP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTC" edc:desc="" edc:mask="0x3" edc:name="DTC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="MDCS" edc:desc="" edc:mask="0x1" edc:name="MDCS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ITB" edc:desc="" edc:mask="0x1" edc:name="ITB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGIEN" edc:desc="" edc:mask="0x1" edc:name="TRGIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLIEN" edc:desc="" edc:mask="0x1" edc:name="CLIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTIEN" edc:desc="" edc:mask="0x1" edc:name="FLTIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSTAT" edc:desc="" edc:mask="0x1" edc:name="TRGSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLSTAT" edc:desc="" edc:mask="0x1" edc:name="CLSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTSTAT" edc:desc="" edc:mask="0x1" edc:name="FLTSTAT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="DTC0" edc:desc="" edc:mask="0x1" edc:name="DTC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTC1" edc:desc="" edc:mask="0x1" edc:name="DTC1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="IOCON4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="IOCON4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSYNC" edc:desc="" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWAP" edc:desc="" edc:mask="0x1" edc:name="SWAP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLDAT" edc:desc="" edc:mask="0x3" edc:name="CLDAT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FLTDAT" edc:desc="" edc:mask="0x3" edc:name="FLTDAT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OVRDAT" edc:desc="" edc:mask="0x3" edc:name="OVRDAT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OVRENL" edc:desc="" edc:mask="0x1" edc:name="OVRENL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVRENH" edc:desc="" edc:mask="0x1" edc:name="OVRENH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD" edc:desc="" edc:mask="0x3" edc:name="PMOD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="POLL" edc:desc="" edc:mask="0x1" edc:name="POLL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POLH" edc:desc="" edc:mask="0x1" edc:name="POLH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PENL" edc:desc="" edc:mask="0x1" edc:name="PENL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PENH" edc:desc="" edc:mask="0x1" edc:name="PENH" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CLDAT0" edc:desc="" edc:mask="0x1" edc:name="CLDAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLDAT1" edc:desc="" edc:mask="0x1" edc:name="CLDAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTDAT0" edc:desc="" edc:mask="0x1" edc:name="FLTDAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTDAT1" edc:desc="" edc:mask="0x1" edc:name="FLTDAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRDAT0" edc:desc="" edc:mask="0x1" edc:name="OVRDAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRDAT1" edc:desc="" edc:mask="0x1" edc:name="OVRDAT1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PMOD0" edc:desc="" edc:mask="0x1" edc:name="PMOD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMOD1" edc:desc="" edc:mask="0x1" edc:name="PMOD1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="FCLCON4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="FCLCON4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTMOD" edc:desc="" edc:mask="0x3" edc:name="FLTMOD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FLTPOL" edc:desc="" edc:mask="0x1" edc:name="FLTPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC" edc:desc="" edc:mask="0x1f" edc:name="FLTSRC" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="CLMOD" edc:desc="" edc:mask="0x1" edc:name="CLMOD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLPOL" edc:desc="" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLSRC" edc:desc="" edc:mask="0x1f" edc:name="CLSRC" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="IFLTMOD" edc:desc="" edc:mask="0x1" edc:name="IFLTMOD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLTMOD0" edc:desc="" edc:mask="0x1" edc:name="FLTMOD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTMOD1" edc:desc="" edc:mask="0x1" edc:name="FLTMOD1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC0" edc:desc="" edc:mask="0x1" edc:name="FLTSRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC1" edc:desc="" edc:mask="0x1" edc:name="FLTSRC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC2" edc:desc="" edc:mask="0x1" edc:name="FLTSRC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC3" edc:desc="" edc:mask="0x1" edc:name="FLTSRC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTSRC4" edc:desc="" edc:mask="0x1" edc:name="FLTSRC4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CLSRC0" edc:desc="" edc:mask="0x1" edc:name="CLSRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC1" edc:desc="" edc:mask="0x1" edc:name="CLSRC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC2" edc:desc="" edc:mask="0x1" edc:name="CLSRC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC3" edc:desc="" edc:mask="0x1" edc:name="CLSRC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLSRC4" edc:desc="" edc:mask="0x1" edc:name="CLSRC4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PDC4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PDC4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PDC4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PHASE4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PHASE4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHASE4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PHASE4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="DTR4" edc:desc="" edc:impl="0x3ffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000000" edc:name="DTR4" edc:nzwidth="0x10" edc:por="--00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTR4" edc:desc="" edc:islanghidden="true" edc:mask="0x3fff" edc:name="DTR4" edc:nzwidth="0xe"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="ALTDTR4" edc:desc="" edc:impl="0x3ffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000000" edc:name="ALTDTR4" edc:nzwidth="0x10" edc:por="--00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ALTDTR4" edc:desc="" edc:islanghidden="true" edc:mask="0x3fff" edc:name="ALTDTR4" edc:nzwidth="0xe"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SDC4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SDC4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDC4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SDC4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SPHASE4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SPHASE4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPHASE4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SPHASE4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
